In [1]:
import pandas as pd
import numpy as np
import pathfinder as pf

In [2]:
filename = "censo_1872_ce-002_p1.csv"
path = pf.find_file(filename)
df = pd.read_csv(path)

In [3]:
df.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28
0,NaN,NaN,NaN,Raças,NaN,NaN,NaN,Estados civis,NaN,NaN,...,Defeitos físicos,NaN,NaN,NaN,NaN,NaN,NaN,Casas,NaN,NaN
1,Condições,Sexos,Almas,Brancos,Pardos,Pretos,Caboclos,Solteiros,Casados,Viúvos,...,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados,Ausentes,Transeuntes,Habitadas,Desabitadas,Fogos
2,Livres,Homens,10322,4940,4332,436,614,7154,2775,393,...,48,6,158,16,11,41,301,NaN,NaN,NaN
3,NaN,Mulheres,9867,4364,4601,470,432,6979,2097,791,...,41,9,32,21,9,76,247,NaN,NaN,NaN
4,NaN,Soma,20189,9304,8933,906,1046,14133,4872,1184,...,89,15,190,37,20,117,548,3359,1025,3403
5,Escravos,Homens,522,0,326,196,0,502,14,6,...,0,0,2,0,0,0,0,NaN,NaN,NaN
6,NaN,Mulheres,661,0,365,296,0,638,19,4,...,0,0,2,2,2,0,0,NaN,NaN,NaN
7,NaN,Soma,1183,0,691,492,0,1140,33,10,...,0,0,4,2,2,0,0,NaN,NaN,NaN
8,NaN,Soma geral,21372,9304,9624,1398,1046,15273,4905,1194,...,89,15,194,39,22,117,548,3359,1025,3403

In [4]:
print(df.columns)

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Instrução',
       'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22',
       'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25', 'Unnamed: 26',
       'Unnamed: 27', 'Unnamed: 28'],
      dtype='object')

# ALMAS

In [5]:
almas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 2']]
almas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0        NaN        NaN        NaN
1  Condições      Sexos      Almas
2     Livres     Homens      10322
3        NaN   Mulheres       9867
4        NaN       Soma      20189

In [6]:
new_header = almas.iloc[1]
almas.columns = new_header
almas = almas[2:]
almas.head()

1 Condições     Sexos  Almas
2    Livres    Homens  10322
3       NaN  Mulheres   9867
4       NaN      Soma  20189
5  Escravos    Homens    522
6       NaN  Mulheres    661

In [7]:
df_no_transpose = almas.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos  Almas
2    Livres      Homens  10322
3       NaN    Mulheres   9867
4       NaN        Soma  20189
5  Escravos      Homens    522
6       NaN    Mulheres    661
7       NaN        Soma   1183
8     Total  Soma geral  21372

In [8]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos  Almas
2    Livres      Homens  10322
3    Livres    Mulheres   9867
4    Livres        Soma  20189
5  Escravos      Homens    522
6  Escravos    Mulheres    661
7  Escravos        Soma   1183
8     Total  Soma geral  21372

In [9]:
colunas_almas = ['Almas']
df_no_transpose[colunas_almas] = df_no_transpose[colunas_almas].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

soma_homens = homens_livres[colunas_almas].sum() + homens_escravos[colunas_almas].sum()

soma_homens

1
Almas    10844
dtype: int64

In [10]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_almas].sum() + mulheres_escravas[colunas_almas].sum()

soma_mulheres

1
Almas    10528
dtype: int64

# RAÇAS

In [11]:
racas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6']]
racas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 3 Unnamed: 4 Unnamed: 5 Unnamed: 6
0        NaN        NaN      Raças        NaN        NaN        NaN
1  Condições      Sexos    Brancos     Pardos     Pretos   Caboclos
2     Livres     Homens       4940       4332        436        614
3        NaN   Mulheres       4364       4601        470        432
4        NaN       Soma       9304       8933        906       1046

In [12]:
new_header = racas.iloc[1]
racas.columns = new_header
racas = racas[2:]
racas.head()

1 Condições     Sexos Brancos Pardos Pretos Caboclos
2    Livres    Homens    4940   4332    436      614
3       NaN  Mulheres    4364   4601    470      432
4       NaN      Soma    9304   8933    906     1046
5  Escravos    Homens       0    326    196        0
6       NaN  Mulheres       0    365    296        0

In [13]:
df_no_transpose = racas.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3       NaN    Mulheres    4364   4601    470      432
4       NaN        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6       NaN    Mulheres       0    365    296        0
7       NaN        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [14]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Brancos Pardos Pretos Caboclos
2    Livres      Homens    4940   4332    436      614
3    Livres    Mulheres    4364   4601    470      432
4    Livres        Soma    9304   8933    906     1046
5  Escravos      Homens       0    326    196        0
6  Escravos    Mulheres       0    365    296        0
7  Escravos        Soma       0    691    492        0
8     Total  Soma geral    9304   9624   1398     1046

In [15]:
colunas_racas = ['Brancos', 'Pardos', 'Pretos', 'Caboclos']
df_no_transpose[colunas_racas] = df_no_transpose[colunas_racas].apply(pd.to_numeric)

# Passo 1: Selecionar as linhas específicas
homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

# Passo 2: Somar os valores das colunas
soma_homens = homens_livres[colunas_racas].sum() + homens_escravos[colunas_racas].sum()

soma_homens

1
Brancos     4940
Pardos      4658
Pretos       632
Caboclos     614
dtype: int64

In [16]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_racas].sum() + mulheres_escravas[colunas_racas].sum()

soma_mulheres

1
Brancos     4364
Pardos      4966
Pretos       766
Caboclos     432
dtype: int64

# ESTADOS CIVIS

In [17]:
estados_civis = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9']]
estados_civis.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 7 Unnamed: 8 Unnamed: 9
0        NaN        NaN  Estados civis        NaN        NaN
1  Condições      Sexos      Solteiros    Casados     Viúvos
2     Livres     Homens           7154       2775        393
3        NaN   Mulheres           6979       2097        791
4        NaN       Soma          14133       4872       1184

In [18]:
new_header = estados_civis.iloc[1]
estados_civis.columns = new_header
estados_civis = estados_civis[2:]
estados_civis.head()

1 Condições     Sexos Solteiros Casados Viúvos
2    Livres    Homens      7154    2775    393
3       NaN  Mulheres      6979    2097    791
4       NaN      Soma     14133    4872   1184
5  Escravos    Homens       502      14      6
6       NaN  Mulheres       638      19      4

In [19]:
df_no_transpose = estados_civis.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Solteiros Casados Viúvos
2    Livres      Homens      7154    2775    393
3       NaN    Mulheres      6979    2097    791
4       NaN        Soma     14133    4872   1184
5  Escravos      Homens       502      14      6
6       NaN    Mulheres       638      19      4
7       NaN        Soma      1140      33     10
8     Total  Soma geral     15273    4905   1194

In [20]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Solteiros Casados Viúvos
2    Livres      Homens      7154    2775    393
3    Livres    Mulheres      6979    2097    791
4    Livres        Soma     14133    4872   1184
5  Escravos      Homens       502      14      6
6  Escravos    Mulheres       638      19      4
7  Escravos        Soma      1140      33     10
8     Total  Soma geral     15273    4905   1194

In [21]:
colunas_estados_civis = ['Casados', 'Solteiros', 'Viúvos']
df_no_transpose[colunas_estados_civis] = df_no_transpose[colunas_estados_civis].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

soma_homens = homens_livres[colunas_estados_civis].sum() + homens_escravos[colunas_estados_civis].sum()

soma_homens

1
Casados      2789
Solteiros    7656
Viúvos        399
dtype: int64

In [22]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_estados_civis].sum() + mulheres_escravas[colunas_estados_civis].sum()

soma_mulheres

1
Casados      2116
Solteiros    7617
Viúvos        795
dtype: int64

# RELIGIÃO

In [23]:
religiao = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 10', 'Unnamed: 11']]
religiao.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 10 Unnamed: 11
0        NaN        NaN    Religião         NaN
1  Condições      Sexos   Católicos  Acatólicos
2     Livres     Homens       10288          34
3        NaN   Mulheres        9859           8
4        NaN       Soma       20147          42

In [24]:
religiao_header = religiao.iloc[1]
religiao.columns = religiao_header
religiao = religiao[2:]
religiao.head()

1 Condições     Sexos Católicos Acatólicos
2    Livres    Homens     10288         34
3       NaN  Mulheres      9859          8
4       NaN      Soma     20147         42
5  Escravos    Homens       522          0
6       NaN  Mulheres       661          0

In [25]:
df_no_transpose = religiao.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Católicos Acatólicos
2    Livres      Homens     10288         34
3       NaN    Mulheres      9859          8
4       NaN        Soma     20147         42
5  Escravos      Homens       522          0
6       NaN    Mulheres       661          0
7       NaN        Soma      1183          0
8     Total  Soma geral     21330         42

In [26]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Católicos Acatólicos
2    Livres      Homens     10288         34
3    Livres    Mulheres      9859          8
4    Livres        Soma     20147         42
5  Escravos      Homens       522          0
6  Escravos    Mulheres       661          0
7  Escravos        Soma      1183          0
8     Total  Soma geral     21330         42

In [27]:
colunas_religiao = ['Católicos', 'Acatólicos']
df_no_transpose[colunas_religiao] = df_no_transpose[colunas_religiao].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

soma_homens = homens_livres[colunas_religiao].sum() + homens_escravos[colunas_religiao].sum()

soma_homens

1
Católicos     10810
Acatólicos       34
dtype: int64

In [28]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_religiao].sum() + mulheres_escravas[colunas_religiao].sum()

soma_mulheres

1
Católicos     10520
Acatólicos        8
dtype: int64

# NACIONALIDADES

In [29]:
nacionalidades = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 12', 'Unnamed: 13']]
nacionalidades.head()

  Unnamed: 0 Unnamed: 1     Unnamed: 12   Unnamed: 13
0        NaN        NaN  Nacionalidades           NaN
1  Condições      Sexos     Brasileiros  Estrangeiros
2     Livres     Homens            9779           543
3        NaN   Mulheres            9661           206
4        NaN       Soma           19440           749

In [30]:
nacionalidades_header = nacionalidades.iloc[1]
nacionalidades.columns = nacionalidades_header
nacionalidades = nacionalidades[2:]
nacionalidades.head()

1 Condições     Sexos Brasileiros Estrangeiros
2    Livres    Homens        9779          543
3       NaN  Mulheres        9661          206
4       NaN      Soma       19440          749
5  Escravos    Homens         522            0
6       NaN  Mulheres         661            0

In [31]:
df_no_transpose = nacionalidades.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Brasileiros Estrangeiros
2    Livres      Homens        9779          543
3       NaN    Mulheres        9661          206
4       NaN        Soma       19440          749
5  Escravos      Homens         522            0
6       NaN    Mulheres         661            0
7       NaN        Soma        1183            0
8     Total  Soma geral       20623          749

In [32]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Brasileiros Estrangeiros
2    Livres      Homens        9779          543
3    Livres    Mulheres        9661          206
4    Livres        Soma       19440          749
5  Escravos      Homens         522            0
6  Escravos    Mulheres         661            0
7  Escravos        Soma        1183            0
8     Total  Soma geral       20623          749

In [33]:
colunas_nacionalidades = ['Brasileiros', 'Estrangeiros']
df_no_transpose[colunas_nacionalidades] = df_no_transpose[colunas_nacionalidades].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

soma_homens = homens_livres[colunas_nacionalidades].sum() + homens_escravos[colunas_nacionalidades].sum()

soma_homens

1
Brasileiros     10301
Estrangeiros      543
dtype: int64

In [34]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_nacionalidades].sum() + mulheres_escravas[colunas_nacionalidades].sum()

soma_mulheres

1
Brasileiros     10322
Estrangeiros      206
dtype: int64

# INSTRUÇÃO

In [35]:
instrucao = df[['Unnamed: 0', 'Unnamed: 1', 'Instrução', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18']]
instrucao.head()

,Unnamed: 0,Unnamed: 1,Instrução,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18
0,NaN,NaN,NaN,NaN,População escolar de 6 a 15 anos,NaN,NaN
1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965

In [36]:
instrucao_header = instrucao.iloc[1]
instrucao.columns = instrucao_header
instrucao = instrucao[2:]
instrucao.head()

1,Condições,Sexos,Sabem ler e escrever,Analfabetos,Frequentam escolas,Não frequentam escolas,Total
2,Livres,Homens,3266,7056,799,1711,2510
3,NaN,Mulheres,1170,8697,559,1896,2455
4,NaN,Soma,4436,15753,1358,3607,4965
5,Escravos,Homens,5,517,0,0,0
6,NaN,Mulheres,6,655,0,0,0

In [37]:
columns_multiindex = pd.MultiIndex.from_tuples([
    ('', 'Condições'),
    ('', 'Sexos'),
    ('', 'Sabem ler e escrever'),
    ('', 'Analfabetos'),
    ('População escolar de 6 a 15 anos', 'Frequentam escolas'),
    ('População escolar de 6 a 15 anos', 'Não frequentam escolas'),
    ('População escolar de 6 a 15 anos', 'Total')
])

instrucao.columns = columns_multiindex

instrucao

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3       NaN    Mulheres                 1170        8697
4       NaN        Soma                 4436       15753
5  Escravos      Homens                    5         517
6       NaN    Mulheres                    6         655
7       NaN        Soma                   11        1172
8       NaN  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [38]:
df_no_transpose = instrucao.copy()
df_no_transpose.loc[8, ('', 'Condições')] = 'Total'
df_no_transpose

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3       NaN    Mulheres                 1170        8697
4       NaN        Soma                 4436       15753
5  Escravos      Homens                    5         517
6       NaN    Mulheres                    6         655
7       NaN        Soma                   11        1172
8     Total  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [39]:
df_no_transpose[('', 'Condições')] = df_no_transpose[('', 'Condições')].ffill()
df_no_transpose

                                                          \
  Condições       Sexos Sabem ler e escrever Analfabetos
2    Livres      Homens                 3266        7056
3    Livres    Mulheres                 1170        8697
4    Livres        Soma                 4436       15753
5  Escravos      Homens                    5         517
6  Escravos    Mulheres                    6         655
7  Escravos        Soma                   11        1172
8     Total  Soma geral                 4447       16925

  População escolar de 6 a 15 anos
                Frequentam escolas Não frequentam escolas Total
2                              799                   1711  2510
3                              559                   1896  2455
4                             1358                   3607  4965
5                                0                      0     0
6                                0                      0     0
7                                0                      0     0
8                             1358                   3607  4965

In [40]:
colunas_adultos = [('', 'Sabem ler e escrever'), ('', 'Analfabetos')]
df_no_transpose[colunas_adultos] = df_no_transpose[colunas_adultos].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Homens')]

soma_homens = homens_livres[colunas_adultos].sum() + homens_escravos[colunas_adultos].sum()

soma_homens

  Sabem ler e escrever    3271
  Analfabetos             7573
dtype: int64

In [41]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_adultos].sum() + mulheres_escravas[colunas_adultos].sum()

soma_mulheres

  Sabem ler e escrever    1176
  Analfabetos             9352
dtype: int64

In [42]:
colunas_jovens = [('População escolar de 6 a 15 anos', 'Frequentam escolas'), ('População escolar de 6 a 15 anos', 'Não frequentam escolas')]
df_no_transpose[colunas_jovens] = df_no_transpose[colunas_jovens].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Homens')]

soma_homens = homens_livres[colunas_jovens].sum() + homens_escravos[colunas_jovens].sum()

soma_homens

População escolar de 6 a 15 anos  Frequentam escolas         799
                                  Não frequentam escolas    1711
dtype: int64

In [43]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_jovens].sum() + mulheres_escravas[colunas_jovens].sum()

soma_mulheres

População escolar de 6 a 15 anos  Frequentam escolas         559
                                  Não frequentam escolas    1896
dtype: int64

In [44]:
colunas_total = [('População escolar de 6 a 15 anos', 'Total')]
df_no_transpose[colunas_total] = df_no_transpose[colunas_total].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Homens')]

soma_homens = homens_livres[colunas_total].sum() + homens_escravos[colunas_total].sum()

soma_homens

População escolar de 6 a 15 anos  Total    2510
dtype: int64

In [45]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Livres') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose[('', 'Condições')] == 'Escravos') & (df_no_transpose[('', 'Sexos')] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_total].sum() + mulheres_escravas[colunas_total].sum()

soma_mulheres

População escolar de 6 a 15 anos  Total    2455
dtype: int64

# DEFICIENTES

In [46]:
deficientes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23']]
deficientes.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23
0,NaN,NaN,Defeitos físicos,NaN,NaN,NaN,NaN
1,Condições,Sexos,Cegos,Surdo-mudos,Aleijados,Dementes,Alienados
2,Livres,Homens,48,6,158,16,11
3,NaN,Mulheres,41,9,32,21,9
4,NaN,Soma,89,15,190,37,20

In [47]:
new_header = deficientes.iloc[1]
deficientes.columns = new_header
deficientes = deficientes[2:]
deficientes.head()

1 Condições     Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres    Homens    48           6       158       16        11
3       NaN  Mulheres    41           9        32       21         9
4       NaN      Soma    89          15       190       37        20
5  Escravos    Homens     0           0         2        0         0
6       NaN  Mulheres     0           0         2        2         2

In [48]:
df_no_transpose = deficientes.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres      Homens    48           6       158       16        11
3       NaN    Mulheres    41           9        32       21         9
4       NaN        Soma    89          15       190       37        20
5  Escravos      Homens     0           0         2        0         0
6       NaN    Mulheres     0           0         2        2         2
7       NaN        Soma     0           0         4        2         2
8     Total  Soma geral    89          15       194       39        22

In [49]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Cegos Surdo-mudos Aleijados Dementes Alienados
2    Livres      Homens    48           6       158       16        11
3    Livres    Mulheres    41           9        32       21         9
4    Livres        Soma    89          15       190       37        20
5  Escravos      Homens     0           0         2        0         0
6  Escravos    Mulheres     0           0         2        2         2
7  Escravos        Soma     0           0         4        2         2
8     Total  Soma geral    89          15       194       39        22

In [50]:
colunas_deficientes = ['Cegos', 'Surdo-mudos', 'Aleijados', 'Dementes', 'Alienados']
df_no_transpose[colunas_deficientes] = df_no_transpose[colunas_deficientes].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
homens_escravos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Homens')]

soma_homens = homens_livres[colunas_deficientes].sum() + homens_escravos[colunas_deficientes].sum()

soma_homens

1
Cegos           48
Surdo-mudos      6
Aleijados      160
Dementes        16
Alienados       11
dtype: int64

In [51]:
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]
mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Mulheres')]

soma_mulheres = mulheres_livres[colunas_deficientes].sum() + mulheres_escravas[colunas_deficientes].sum()

soma_mulheres

1
Cegos          41
Surdo-mudos     9
Aleijados      34
Dementes       23
Alienados      11
dtype: int64

# AUSENTES

In [52]:
ausentes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 24']]
ausentes.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 24
0        NaN        NaN         NaN
1  Condições      Sexos    Ausentes
2     Livres     Homens          41
3        NaN   Mulheres          76
4        NaN       Soma         117

In [53]:
new_header = ausentes.iloc[1]
ausentes.columns = new_header
ausentes = ausentes[2:]
ausentes.head()

1 Condições     Sexos Ausentes
2    Livres    Homens       41
3       NaN  Mulheres       76
4       NaN      Soma      117
5  Escravos    Homens        0
6       NaN  Mulheres        0

In [54]:
df_no_transpose = ausentes.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Ausentes
2    Livres      Homens       41
3       NaN    Mulheres       76
4       NaN        Soma      117
5  Escravos      Homens        0
6       NaN    Mulheres        0
7       NaN        Soma        0
8     Total  Soma geral      117

In [55]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Ausentes
2    Livres      Homens       41
3    Livres    Mulheres       76
4    Livres        Soma      117
5  Escravos      Homens        0
6  Escravos    Mulheres        0
7  Escravos        Soma        0
8     Total  Soma geral      117

In [56]:
colunas_ausentes = ['Ausentes']
df_no_transpose[colunas_ausentes] = df_no_transpose[colunas_ausentes].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]

print(homens_livres[colunas_ausentes].sum())
print(mulheres_livres[colunas_ausentes].sum())

1
Ausentes    41
dtype: int64
1
Ausentes    76
dtype: int64

In [57]:
soma_livres = homens_livres[colunas_ausentes].sum() + mulheres_livres[colunas_ausentes].sum()

soma_livres

1
Ausentes    117
dtype: int64

# TRANSEUNTES

In [58]:
transeuntes = df[['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 25']]
transeuntes.head()

  Unnamed: 0 Unnamed: 1  Unnamed: 25
0        NaN        NaN          NaN
1  Condições      Sexos  Transeuntes
2     Livres     Homens          301
3        NaN   Mulheres          247
4        NaN       Soma          548

In [59]:
new_header = transeuntes.iloc[1]
transeuntes.columns = new_header
transeuntes = transeuntes[2:]
transeuntes.head()

1 Condições     Sexos Transeuntes
2    Livres    Homens         301
3       NaN  Mulheres         247
4       NaN      Soma         548
5  Escravos    Homens           0
6       NaN  Mulheres           0

In [60]:
df_no_transpose = transeuntes.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Transeuntes
2    Livres      Homens         301
3       NaN    Mulheres         247
4       NaN        Soma         548
5  Escravos      Homens           0
6       NaN    Mulheres           0
7       NaN        Soma           0
8     Total  Soma geral         548

In [61]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Transeuntes
2    Livres      Homens         301
3    Livres    Mulheres         247
4    Livres        Soma         548
5  Escravos      Homens           0
6  Escravos    Mulheres           0
7  Escravos        Soma           0
8     Total  Soma geral         548

In [62]:
colunas_transeuntes = ['Transeuntes']
df_no_transpose[colunas_transeuntes] = df_no_transpose[colunas_transeuntes].apply(pd.to_numeric)

homens_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Homens')]
mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Mulheres')]

print(homens_livres[colunas_transeuntes].sum())
print(mulheres_livres[colunas_transeuntes].sum())

1
Transeuntes    301
dtype: int64
1
Transeuntes    247
dtype: int64

In [63]:
soma_livres = homens_livres[colunas_transeuntes].sum() + mulheres_livres[colunas_transeuntes].sum()

soma_livres

1
Transeuntes    548
dtype: int64

# CASAS

In [64]:
casas = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 26', 'Unnamed: 27']]
casas.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 26  Unnamed: 27
0        NaN        NaN       Casas          NaN
1  Condições      Sexos   Habitadas  Desabitadas
2     Livres     Homens         NaN          NaN
3        NaN   Mulheres         NaN          NaN
4        NaN       Soma        3359         1025

In [65]:
new_header = casas.iloc[1]
casas.columns = new_header
casas = casas[2:]
casas.head()

1 Condições     Sexos Habitadas Desabitadas
2    Livres    Homens       NaN         NaN
3       NaN  Mulheres       NaN         NaN
4       NaN      Soma      3359        1025
5  Escravos    Homens       NaN         NaN
6       NaN  Mulheres       NaN         NaN

In [66]:
df_no_transpose = casas.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Habitadas Desabitadas
2    Livres      Homens       NaN         NaN
3       NaN    Mulheres       NaN         NaN
4       NaN        Soma      3359        1025
5  Escravos      Homens       NaN         NaN
6       NaN    Mulheres       NaN         NaN
7       NaN        Soma       NaN         NaN
8     Total  Soma geral      3359        1025

In [67]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Habitadas Desabitadas
2    Livres      Homens       NaN         NaN
3    Livres    Mulheres       NaN         NaN
4    Livres        Soma      3359        1025
5  Escravos      Homens       NaN         NaN
6  Escravos    Mulheres       NaN         NaN
7  Escravos        Soma       NaN         NaN
8     Total  Soma geral      3359        1025

In [68]:
colunas_casas = ['Habitadas', 'Desabitadas']
df_no_transpose[colunas_casas] = df_no_transpose[colunas_casas].apply(pd.to_numeric)

casas_habitadas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Soma')]
casas_desabitadas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Soma')]

soma_casas  = casas_habitadas[colunas_casas].sum() + casas_desabitadas[colunas_casas].sum()

soma_casas

1
Habitadas      3359.0
Desabitadas    1025.0
dtype: float64

# FOGOS

In [69]:
fogos = df[['Unnamed: 0','Unnamed: 1', 'Unnamed: 28']]
fogos.head()

  Unnamed: 0 Unnamed: 1 Unnamed: 28
0        NaN        NaN         NaN
1  Condições      Sexos       Fogos
2     Livres     Homens         NaN
3        NaN   Mulheres         NaN
4        NaN       Soma        3403

In [70]:
new_header = fogos.iloc[1]
fogos.columns = new_header
fogos = fogos[2:]
fogos.head()

1 Condições     Sexos Fogos
2    Livres    Homens   NaN
3       NaN  Mulheres   NaN
4       NaN      Soma  3403
5  Escravos    Homens   NaN
6       NaN  Mulheres   NaN

In [71]:
df_no_transpose = fogos.copy()
df_no_transpose.loc[8, "Condições"] = 'Total'
df_no_transpose

1 Condições       Sexos Fogos
2    Livres      Homens   NaN
3       NaN    Mulheres   NaN
4       NaN        Soma  3403
5  Escravos      Homens   NaN
6       NaN    Mulheres   NaN
7       NaN        Soma   NaN
8     Total  Soma geral  3403

In [72]:
df_no_transpose['Condições'] = df_no_transpose['Condições'].ffill()
df_no_transpose

1 Condições       Sexos Fogos
2    Livres      Homens   NaN
3    Livres    Mulheres   NaN
4    Livres        Soma  3403
5  Escravos      Homens   NaN
6  Escravos    Mulheres   NaN
7  Escravos        Soma   NaN
8     Total  Soma geral  3403

In [73]:
colunas_fogos = ['Fogos']
df_no_transpose[colunas_fogos] = df_no_transpose[colunas_fogos].apply(pd.to_numeric)

soma_fogos = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Soma')]

soma_fogos

1 Condições Sexos   Fogos
4    Livres  Soma  3403.0

In [74]:
#colunas_fogos = ['Fogos']
#df_no_transpose[colunas_fogos] = df_no_transpose[colunas_fogos].apply(pd.to_numeric)

#mulheres_livres = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Livres') & (df_no_transpose['Sexos'] == 'Soma')]
#mulheres_escravas = df_no_transpose.loc[(df_no_transpose['Condições'] == 'Escravos') & (df_no_transpose['Sexos'] == 'Soma')]

#soma_mulheres = mulheres_livres[colunas_fogos].sum() + mulheres_escravas[colunas_fogos].sum()

#soma_mulheres